print("                               ")
print("            Привет!            ")
print("                               ")
print("   Это игра крестики-нолики    ")
print("                               ")
print('''         Правила игры: 
 Играют двое,ходят по очереди.
  Для хода необходимо ввести 
       две координаты: 
  Первая, это номер строки,
  Вторая, это номер столбца.
Внимание! Диапазон вводимых координат
   от ноля до двух, включительно'''    )
print("                               ")
print("         Приятной игры!       ")